/**
  ******************************************************************************
  * @file    TblType.cpp
  * @author  Dmitriy Ermakov
  * @brief   Класс работы с таблицей type базы данных
  *          Этот класс организует общение слоя бизнес-логики с базой данных
  *
  @verbatim
  ==============================================================================
                    ##### Описание #####
  ==============================================================================
  [..] 
  () Чтение записей базы данных
  () Вставка записей в базу данных
  () Изменение записей в базе данных
  () Удаление записей из базы данных

  ==============================================================================
                     ##### Как использовать #####
  ==============================================================================  
  [..]
  
  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) .
  * All rights reserved.</center></h2>
  *
  *
  ******************************************************************************
  */ 

#include "../inc/TblType.h"
#include "../inc/dbg.h"

#include <string>

/**
  * @brief      Конструктор
  * @param      none
  * @retval     none
  */
TblType::TblType(){

}