/**
  ******************************************************************************
  * @file    Type.cpp
  * @author  Dmitriy Ermakov
  * @brief   Класс для хранения одной записи из таблицы Type
  *          
  *
  @verbatim
  ==============================================================================
                    ##### Описание #####
  ==============================================================================
  [..] 
  () 

  ==============================================================================
                     ##### Как использовать #####
  ==============================================================================  
  [..]
  
  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) .
  * All rights reserved.</center></h2>
  *
  *
  ******************************************************************************
  */ 

#include "../inc/Type.h"
#include "../inc/dbg.h"

#include <string>

/**
  * @brief      Конструктор
  * @param      _id 
  * @param      _Name название типа
  * @param      _ParentId id родительского типа
  * @retval     none
  */
Type::Type(int _id, std::string _Name, int _ParentId){
    this->id = _id;
    this->Name = _Name;
    this->ParentId = _ParentId;
}